const question = {
  0: {
    question:
      "수강 신청에서 밀려 들어간 평점 낮은 프로그래밍 수업, 교수님이 듣도보도 못한 프로그래밍 언어를 사용하는 과제를 내주셨습니다. 당신이 제일 먼저 하는 행동은 무엇인가요?",
    0: "학교 커뮤니티에 들어가 사람들의 과제에 대한 반응을 찾는다.",
    1: "수업을 같이 듣는 친구에게 과제에 대해 물어본다.",
    2: "조교님이 올린 과제 명세를 꼼꼼히 읽는다.",
    3: "명세를 대충 훑고 뭐하는 언어인지 구글에 쳐본다.",
  },
  1: {
    question:
      "당신은 좌표를 계산하여 반환하는 함수를 짜야합니다. 일단 이름을 지어줘야겠네요. 뭐라고 할까요?",
    0: "calculateCoordinate",
    1: "calculate_coordinate",
    2: "cc",
    3: "a",
  },
  2: {
    question:
      "친해진지 얼마 되지 않은 동기와 한경관에 간 당신, 제육볶음을 먹을 생각에 신나는데요. 제육이 한참 남았는데 동기는 다 먹은 눈치입니다.",
    0: "미안한 마음에 심심할까봐 괜히 몇 마디 떠든다.",
    1: "허겁지겁 빨리 먹는다.",
    2: "먼저 가라고 한다.",
    3: "그냥 내 페이스대로 먹는다.",
  },
  3: {
    question:
      "코드를 짜다가 에러가 났는데 이유를 알 수가 없습니다. 구글에 찾아봐도 자료가 잘 나오지 않고, 12번째 시도도 실패로 돌아갔습니다.",
    0: "아예 처음부터 코드를 다시 짠다.",
    1: "누가 이기나보자! 13번째 시도를 한다.",
    2: "잠깐 산책이나 다른 일을 하고 온다.",
    3: "관련 공식 문서/명세를 처음부터 다시 읽는다.",
  },
  4: {
    question:
      "코딩테스트 준비를 위해 알고리즘 문제를 풀던 당신, 도저히 에러 이유를 알 수 없어 다른 친구에게 도움을 청합니다. 한참을 같이 들여다보다가, 사소한 오타를 친구가 발견합니다.",
    0: "부끄러워서 변명을 한다. 오늘 컨디션이 안 좋아서…",
    1: "친구를 칭찬한다. 역시 고수는 다르다!",
    2: "이것 때문에 내 시간이 날아가다니! 허무해져서 컴퓨터를 덮는다.",
    3: "이런 것도 실력이지. 다시 실수하지 않게 자신의 실수를 기록한다.",
  },
  5: {
    question:
      "협업 프로젝트를 하던 당신, 동아리 친구와 서로의 코드를 합치려는데, 친구가 기획/개발 내용을 다르게 이해하여 코드를 다시 짜야 합칠 수 있는 상황입니다.",
    0: "친구의 코드를 내가 고친다.",
    1: "남의 코드 언제 읽어? 친구가 이해한 내용에 맞춰 내 코드를 고친다.",
    2: "남의 코드 언제 읽어? 친구의 코드를 버리고 내 코드로 완성한다.",
    3: "내가 잘못한 건 아니잖아? 친구에게 고치라고 한다",
  },
  6: {
    question:
      "게임 프로젝트에 참여한 당신, 팀원들과 어떤 게임을 만들지 다 같이 아이디어를 냅니다. 일단 장르를 정하기로 했는데요. 원래 하고 싶던 게 있었다며 당신이 의견을 꺼냅니다.",
    0: "시원한 액션 게임",
    1: "설레는 연애 게임",
    2: "캐주얼한 퍼즐 게임",
    3: "웅장한 RPG 게임",
  },
  7: {
    question:
      "학기와 방학을 즐겁게 다니다보니 동아리 최소 활동 시간이 부족한 당신, 열린 세미나 중에 아무거나 참여해야합니다. 모두 생소한데요. 어떤 주제로 들어볼까요?",
    0: "보안",
    1: "자연어 처리",
    2: "그래픽",
    3: "네이티브 앱",
  },
};
export default question;
